STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/app_ble.c
  if(bleAppContext.pairing_status != 0xFF)
  {
    status = aci_gap_set_security(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                  GAP_SECURITY_LEVEL_2,
                                  0x00);
    
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : Pairing request: 0x%X\n", status);
      bleAppContext.pairing_status = 0x01;
    }
    else
    {
      APP_DBG_MSG("  Success: Pairing request\n");
      bleAppContext.pairing_status = 0x02;
      BLEStack_Process_Schedule();
    }
  }
  return;
}

/* CFG_TASK_BONDED_STATE */
__USED void After_Bonded_Task(void)
{
  HAL_RADIO_TIMER_StopVirtualTimer(&bleAppContext.ANCS_timer_Id);
  
  bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER_IDLE;

  clientHandleNotification.ConnHdl = bleAppContext.BleApplicationContext_legacy.connectionHandle;
  clientHandleNotification.ConnOpcode = PEER_CONN_HANDLE_EVT;
  GATT_CLIENT_APP_Notification(&clientHandleNotification);
  
  APP_DBG_MSG("Discovers ANCS service, characteristic, and descriptor, and enables all notifications.\n");
  UTIL_SEQ_SetTask( 1U << CFG_TASK_CLIENT_DISCOVER_ANCS, CFG_SEQ_PRIO_0);
  
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.ANCS_timer_Id, SHOW_NOTIF_TIMEOUT * 2);
  
  return;
}

void Start_Connection(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    APP_DBG_MSG("Device is already connected. Initiating disconnection process.\n");
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_TERMINATE);
  }
  else
  {
    if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
    {
      APP_DBG_MSG("Relaunch advertising\n");
      /* Relaunch advertising */  
      if(0)
      {
        /* Start advertising in connectable mode only */
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST_ONLY_CONNECTABLE);   
      }
      else
      {
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
      }
    }
  }
  
  return;
}


/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER_IDLE)
  {
    UTIL_SEQ_SetTask( 1U << CFG_TASK_GATT_CLIENT_BUTTON_1, CFG_SEQ_PRIO_0);
  }

  return;
}

void APPE_Button2Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER_IDLE)
  {
    UTIL_SEQ_SetTask( 1U << CFG_TASK_GATT_CLIENT_BUTTON_2, CFG_SEQ_PRIO_0);
  }
  return;
}

void APPE_Button3Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER_IDLE)
  {
    UTIL_SEQ_SetTask( 1U << CFG_TASK_GATT_CLIENT_BUTTON_3, CFG_SEQ_PRIO_0);
  }
  
  return;
}

void APPE_Button3LongPressAction(void)
{

  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER_IDLE)
  {

    
  }
  
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
